       PROCESS NODLL,NODYNAM,TEST(NOSEP),NOCICS,NOSQL,PGMN(LU)
      *+---------------------------------------------------------------+
      *| Tlgicdb0                                                      |
      *| Product: IBM Developer for z/OS                               |
      *| Component: IBM z/OS Automated Unit Testing Framework (zUnit)  |
      *|   for Enterprise COBOL and PL/I                               |
      *| Program: Enterprise COBOL zUnit Test Case for Dynamic Runner  |
      *| Date Generated: 04/20/2020 12:08                              |
      *| ID: 6ea0b529-590e-4ba6-8ee3-50ddefa2a081                      |
      *+---------------------------------------------------------------+
      *+---------------------------------------------------------------+
      *| TEST_TEST2                                                    |
      *|     This program is for Test TEST2                            |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'TEST_TEST2'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PROGRAM-NAME   PIC X(8)  VALUE 'LGICDB01'.
       01 AZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM CICS CALLBACK'.
       01  AZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  AZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  AZ-P3 PIC X(3) VALUE 'AZU'.
       01 AZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 ASSERT-ST.
         03 ASSERT-RC PIC 9(9) BINARY VALUE 4.
         03 ASSERT-TEXT PIC 9(4) BINARY VALUE 0.
       01 AZ-TEST-NAME-LEN       PIC S9(9) COMP-5 EXTERNAL.
       01 AZ-TEST-NAME           PIC X(254) EXTERNAL.
       1 AZ-TEST-EXPECTED-DATA-VALUE.
          3 ZUT00000000.
            5 PIC X(6) DISPLAY VALUE '01ICUS'.
          3 ZUT00000001.
            5 PIC X(4) DISPLAY VALUE 'Andy'.
            5 PIC X(6) DISPLAY VALUE SPACES.
          3 ZUT00000002.
            5 PIC X(5) DISPLAY VALUE 'Pandy'.
            5 PIC X(15) DISPLAY VALUE SPACES.
          3 ZUT00000003.
            5 PIC X(10) DISPLAY VALUE '1950-07-11'.
          3 ZUT00000004.
            5 PIC X(20) DISPLAY VALUE SPACES.
          3 ZUT00000005.
            5 PIC X(2) DISPLAY VALUE '35'.
            5 PIC X(2) DISPLAY VALUE SPACES.
          3 ZUT00000006.
            5 PIC X(7) DISPLAY VALUE 'PI101OO'.
            5 PIC X(1) DISPLAY VALUE SPACES.
          3 ZUT00000007.
            5 PIC X(12) DISPLAY VALUE '07799 123456'.
            5 PIC X(8) DISPLAY VALUE SPACES.
          3 ZUT00000008.
            5 PIC X(12) DISPLAY VALUE '01962 811234'.
            5 PIC X(8) DISPLAY VALUE SPACES.
          3 ZUT00000009.
            5 PIC X(20) DISPLAY VALUE 'A.Pandy@beebhouse.co'.
            5 PIC X(1) DISPLAY VALUE 'm'.
            5 PIC X(79) DISPLAY VALUE SPACES.
          3 ZUT0000000A.
            5 PIC X(32267) DISPLAY VALUE SPACES.
       1 AZ-COMPARE.
         3 AZ-COMPARE-ITEM-NAME-PTR  POINTER.
         3 AZ-COMPARE-ITEM-NAME-LEN  PIC S9(9) COMP-5.
         3 AZ-COMPARE-ITEM-VALUE-PTR POINTER.
         3 AZ-COMPARE-ITEM-VALUE-LEN PIC S9(9) COMP-5.
         3 AZ-COMPARE-ITEM-EXP-VALUE-PTR POINTER.
         3 AZ-COMPARE-ITEM-EXP-VALUE-LEN PIC S9(9) COMP-5.
       LOCAL-STORAGE SECTION.
       1 AZ-COMPARE-ITEM-NAMES.
         3 ZUT0000000B.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT0000000D.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT0000000F.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-NUM OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT00000011.
            5 PIC X(20) DISPLAY VALUE 'CA-FIRST-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000013.
            5 PIC X(20) DISPLAY VALUE 'CA-LAST-NAME OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT00000015.
            5 PIC X(20) DISPLAY VALUE 'CA-DOB OF CA-CUSTOME'.
            5 PIC X(20) DISPLAY VALUE 'R-REQUEST OF DFHCOMM'.
            5 PIC X(4) DISPLAY VALUE 'AREA'.
         3 ZUT00000017.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000019.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NUM OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000001B.
            5 PIC X(20) DISPLAY VALUE 'CA-POSTCODE OF CA-CU'.
            5 PIC X(20) DISPLAY VALUE 'STOMER-REQUEST OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT0000001D.
            5 PIC X(20) DISPLAY VALUE 'CA-NUM-POLICIES OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT0000001F.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-MOBILE OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000021.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-HOME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000023.
            5 PIC X(20) DISPLAY VALUE 'CA-EMAIL-ADDRESS OF '.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-REQUEST '.
            5 PIC X(14) DISPLAY VALUE 'OF DFHCOMMAREA'.
         3 ZUT00000025.
            5 PIC X(20) DISPLAY VALUE 'CA-POLICY-DATA OF CA'.
            5 PIC X(20) DISPLAY VALUE '-CUSTOMER-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT00000027.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000028.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000029.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-NUM OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000002A.
            5 PIC X(20) DISPLAY VALUE 'CA-FIRST-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT0000002B.
            5 PIC X(20) DISPLAY VALUE 'CA-LAST-NAME OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000002C.
            5 PIC X(20) DISPLAY VALUE 'CA-DOB OF CA-CUSTOME'.
            5 PIC X(20) DISPLAY VALUE 'R-REQUEST OF DFHCOMM'.
            5 PIC X(4) DISPLAY VALUE 'AREA'.
         3 ZUT0000002D.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT0000002E.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NUM OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000002F.
            5 PIC X(20) DISPLAY VALUE 'CA-POSTCODE OF CA-CU'.
            5 PIC X(20) DISPLAY VALUE 'STOMER-REQUEST OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000030.
            5 PIC X(20) DISPLAY VALUE 'CA-NUM-POLICIES OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000031.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-MOBILE OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000032.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-HOME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000033.
            5 PIC X(20) DISPLAY VALUE 'CA-EMAIL-ADDRESS OF '.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-REQUEST '.
            5 PIC X(14) DISPLAY VALUE 'OF DFHCOMMAREA'.
         3 ZUT00000034.
            5 PIC X(20) DISPLAY VALUE 'CA-POLICY-DATA OF CA'.
            5 PIC X(20) DISPLAY VALUE '-CUSTOMER-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT00000035.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000036.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000037.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-NUM OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
       1 AZ-COMPARE-WORK-ITEMS.
          3 ZUT0000000C PIC X(6) OCCURS 2.
          3 ZUT0000000E PIC 9(2) OCCURS 2.
          3 ZUT00000010 PIC 9(10) OCCURS 2.
          3 ZUT00000012 PIC X(10) OCCURS 2.
          3 ZUT00000014 PIC X(20) OCCURS 2.
          3 ZUT00000016 PIC X(10) OCCURS 2.
          3 ZUT00000018 PIC X(20) OCCURS 2.
          3 ZUT0000001A PIC X(4) OCCURS 2.
          3 ZUT0000001C PIC X(8) OCCURS 2.
          3 ZUT0000001E PIC 9(3) OCCURS 2.
          3 ZUT00000020 PIC X(20) OCCURS 2.
          3 ZUT00000022 PIC X(20) OCCURS 2.
          3 ZUT00000024 PIC X(100) OCCURS 2.
          3 ZUT00000026 PIC X(32267) OCCURS 2.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-COMPARE-ITEM-NAME      PIC X(254).
       01 AZ-COMPARE-ITEM-VALUE     PIC X(254).
       01 AZ-COMPARE-ITEM-EXP-VALUE PIC X(254).
       1 DFHEIBLK.
         2 EIBTIME PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBDATE PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRNID PICTURE X(4).
         2 EIBTASKN PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRMID PICTURE X(4).
         2 DFHEIGDI PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCPOSN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCALEN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBAID PICTURE X(1).
         2 EIBFN PICTURE X(2).
         2 EIBRCODE PICTURE X(6).
         2 EIBDS PICTURE X(8).
         2 EIBREQID PICTURE X(8).
         2 EIBRSRCE PICTURE X(8).
         2 EIBSYNC PICTURE X.
         2 EIBFREE PICTURE X.
         2 EIBRECV PICTURE X.
         2 EIBSEND PICTURE X.
         2 EIBATT PICTURE X.
         2 EIBEOC PICTURE X.
         2 EIBFMH PICTURE X.
         2 EIBCOMPL PICTURE X(1).
         2 EIBSIG PICTURE X(1).
         2 EIBCONF PICTURE X(1).
         2 EIBERR PICTURE X(1).
         2 EIBERRCD PICTURE X(4).
         2 EIBSYNRB PICTURE X.
         2 EIBNODAT PICTURE X.
         2 EIBRESP PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRESP2 PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRLDBK PICTURE X(1).
       1 DFHCOMMAREA.
         3 CA-REQUEST-ID PIC X(6).
         3 CA-RETURN-CODE PIC 9(2).
         3 CA-CUSTOMER-NUM PIC 9(10).
         3 CA-REQUEST-SPECIFIC PIC X(32482).
         3 CA-CUSTOMER-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-FIRST-NAME PIC X(10).
         5 CA-LAST-NAME PIC X(20).
         5 CA-DOB PIC X(10).
         5 CA-HOUSE-NAME PIC X(20).
         5 CA-HOUSE-NUM PIC X(4).
         5 CA-POSTCODE PIC X(8).
         5 CA-NUM-POLICIES PIC 9(3).
         5 CA-PHONE-MOBILE PIC X(20).
         5 CA-PHONE-HOME PIC X(20).
         5 CA-EMAIL-ADDRESS PIC X(100).
         5 CA-POLICY-DATA PIC X(32267).
         3 CA-CUSTSECR-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-CUSTSECR-PASS PIC X(32).
         5 CA-CUSTSECR-COUNT PIC X(4).
         5 CA-CUSTSECR-STATE PIC X.
         5 CA-CUSTSECR-DATA PIC X(32445).
         3 CA-POLICY-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-POLICY-NUM PIC 9(10).
         5 CA-POLICY-COMMON.
         7 CA-ISSUE-DATE PIC X(10).
         7 CA-EXPIRY-DATE PIC X(10).
         7 CA-LASTCHANGED PIC X(26).
         7 CA-BROKERID PIC 9(10).
         7 CA-BROKERSREF PIC X(10).
         7 CA-PAYMENT PIC 9(6).
         5 CA-POLICY-SPECIFIC PIC X(32400).
         5 CA-ENDOWMENT REDEFINES CA-POLICY-SPECIFIC.
         7 CA-E-WITH-PROFITS PIC X.
         7 CA-E-EQUITIES PIC X.
         7 CA-E-MANAGED-FUND PIC X.
         7 CA-E-FUND-NAME PIC X(10).
         7 CA-E-TERM PIC 99.
         7 CA-E-SUM-ASSURED PIC 9(6).
         7 CA-E-LIFE-ASSURED PIC X(31).
         7 CA-E-PADDING-DATA PIC X(32348).
         5 CA-HOUSE REDEFINES CA-POLICY-SPECIFIC.
         7 CA-H-PROPERTY-TYPE PIC X(15).
         7 CA-H-BEDROOMS PIC 9(3).
         7 CA-H-VALUE PIC 9(8).
         7 CA-H-HOUSE-NAME PIC X(20).
         7 CA-H-HOUSE-NUMBER PIC X(4).
         7 CA-H-POSTCODE PIC X(8).
         7 CA-H-FILLER PIC X(32342).
         5 CA-MOTOR REDEFINES CA-POLICY-SPECIFIC.
         7 CA-M-MAKE PIC X(15).
         7 CA-M-MODEL PIC X(15).
         7 CA-M-VALUE PIC 9(6).
         7 CA-M-REGNUMBER PIC X(7).
         7 CA-M-COLOUR PIC X(8).
         7 CA-M-CC PIC 9(4).
         7 CA-M-MANUFACTURED PIC X(10).
         7 CA-M-PREMIUM PIC 9(6).
         7 CA-M-ACCIDENTS PIC 9(6).
         7 CA-M-FILLER PIC X(32323).
         5 CA-COMMERCIAL REDEFINES CA-POLICY-SPECIFIC.
         7 CA-B-ADDRESS PIC X(255).
         7 CA-B-POSTCODE PIC X(8).
         7 CA-B-LATITUDE PIC X(11).
         7 CA-B-LONGITUDE PIC X(11).
         7 CA-B-CUSTOMER PIC X(255).
         7 CA-B-PROPTYPE PIC X(255).
         7 CA-B-FIREPERIL PIC 9(4).
         7 CA-B-FIREPREMIUM PIC 9(8).
         7 CA-B-CRIMEPERIL PIC 9(4).
         7 CA-B-CRIMEPREMIUM PIC 9(8).
         7 CA-B-FLOODPERIL PIC 9(4).
         7 CA-B-FLOODPREMIUM PIC 9(8).
         7 CA-B-WEATHERPERIL PIC 9(4).
         7 CA-B-WEATHERPREMIUM PIC 9(8).
         7 CA-B-STATUS PIC 9(4).
         7 CA-B-REJECTREASON PIC X(255).
         7 CA-B-FILLER PIC X(31298).
         5 CA-CLAIM REDEFINES CA-POLICY-SPECIFIC.
         7 CA-C-NUM PIC 9(10).
         7 CA-C-DATE PIC X(10).
         7 CA-C-PAID PIC 9(8).
         7 CA-C-VALUE PIC 9(8).
         7 CA-C-CAUSE PIC X(255).
         7 CA-C-OBSERVATIONS PIC X(255).
         7 CA-C-FILLER PIC X(31854).
       PROCEDURE DIVISION USING AZ-TEST
                      DFHEIBLK DFHCOMMAREA.
      * START
           DISPLAY 'TEST_TEST2 Started...'
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
           MOVE AZ-TEST TO AZ-TEST-NAME.
      * SET INPUT VALUE
      * CALL TEST PROGRAM
           DISPLAY 'CALL LGICDB01'
           CALL PROGRAM-NAME
           USING DFHEIBLK DFHCOMMAREA
           .
      * EVALUATE OUTPUT VALUE
             IF CA-REQUEST-ID OF DFHCOMMAREA = ZUT00000000 THEN
               CONTINUE
             ELSE
               MOVE CA-REQUEST-ID OF DFHCOMMAREA TO ZUT0000000C(1)
               MOVE ZUT00000000 TO ZUT0000000C(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000035
               MOVE LENGTH OF ZUT00000035 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000000C(1)
               MOVE 6 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000C(2)
               MOVE 6 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF (CA-RETURN-CODE OF DFHCOMMAREA IS NUMERIC)
                 AND (CA-RETURN-CODE OF DFHCOMMAREA = 0) THEN
               CONTINUE
             ELSE
               MOVE CA-RETURN-CODE OF DFHCOMMAREA TO ZUT0000000E(1)
               MOVE 0 TO ZUT0000000E(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000036
               MOVE LENGTH OF ZUT00000036 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000000E(1)
               MOVE 2 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000E(2)
               MOVE 2 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF (CA-CUSTOMER-NUM OF DFHCOMMAREA IS NUMERIC)
                 AND (CA-CUSTOMER-NUM OF DFHCOMMAREA = 0000000001) THEN
               CONTINUE
             ELSE
               MOVE CA-CUSTOMER-NUM OF DFHCOMMAREA TO ZUT00000010(1)
               MOVE 0000000001 TO ZUT00000010(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000037
               MOVE LENGTH OF ZUT00000037 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000010(1)
               MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000010(2)
               MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-FIRST-NAME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000001 THEN
               CONTINUE
             ELSE
               MOVE CA-FIRST-NAME OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000012(1)
               MOVE ZUT00000001 TO ZUT00000012(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002A
               MOVE LENGTH OF ZUT0000002A TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000012(1)
               MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000012(2)
               MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-LAST-NAME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000002 THEN
               CONTINUE
             ELSE
               MOVE CA-LAST-NAME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           TO ZUT00000014(1)
               MOVE ZUT00000002 TO ZUT00000014(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002B
               MOVE LENGTH OF ZUT0000002B TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000014(1)
               MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000014(2)
               MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-DOB OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000003 THEN
               CONTINUE
             ELSE
               MOVE CA-DOB OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA TO
           ZUT00000016(1)
               MOVE ZUT00000003 TO ZUT00000016(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002C
               MOVE LENGTH OF ZUT0000002C TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000016(1)
               MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000016(2)
               MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-HOUSE-NAME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000004 THEN
               CONTINUE
             ELSE
               MOVE CA-HOUSE-NAME OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000018(1)
               MOVE ZUT00000004 TO ZUT00000018(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002D
               MOVE LENGTH OF ZUT0000002D TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000018(1)
               MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000018(2)
               MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-HOUSE-NUM OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000005 THEN
               CONTINUE
             ELSE
               MOVE CA-HOUSE-NUM OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           TO ZUT0000001A(1)
               MOVE ZUT00000005 TO ZUT0000001A(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002E
               MOVE LENGTH OF ZUT0000002E TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000001A(1)
               MOVE 4 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000001A(2)
               MOVE 4 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-POSTCODE OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000006 THEN
               CONTINUE
             ELSE
               MOVE CA-POSTCODE OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           TO ZUT0000001C(1)
               MOVE ZUT00000006 TO ZUT0000001C(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002F
               MOVE LENGTH OF ZUT0000002F TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000001C(1)
               MOVE 8 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000001C(2)
               MOVE 8 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF (CA-NUM-POLICIES OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           IS NUMERIC)
                 AND (CA-NUM-POLICIES OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA = 0) THEN
               CONTINUE
             ELSE
               MOVE CA-NUM-POLICIES OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT0000001E(1)
               MOVE 0 TO ZUT0000001E(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000030
               MOVE LENGTH OF ZUT00000030 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000001E(1)
               MOVE 3 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000001E(2)
               MOVE 3 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-PHONE-MOBILE OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           = ZUT00000007 THEN
               CONTINUE
             ELSE
               MOVE CA-PHONE-MOBILE OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000020(1)
               MOVE ZUT00000007 TO ZUT00000020(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000031
               MOVE LENGTH OF ZUT00000031 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000020(1)
               MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000020(2)
               MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-PHONE-HOME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000008 THEN
               CONTINUE
             ELSE
               MOVE CA-PHONE-HOME OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000022(1)
               MOVE ZUT00000008 TO ZUT00000022(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000032
               MOVE LENGTH OF ZUT00000032 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000022(1)
               MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000022(2)
               MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-EMAIL-ADDRESS OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           = ZUT00000009 THEN
               CONTINUE
             ELSE
               MOVE CA-EMAIL-ADDRESS OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000024(1)
               MOVE ZUT00000009 TO ZUT00000024(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000033
               MOVE LENGTH OF ZUT00000033 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000024(1)
               MOVE 100 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000024(2)
               MOVE 100 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-POLICY-DATA OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT0000000A THEN
               CONTINUE
             ELSE
               MOVE CA-POLICY-DATA OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000026(1)
               MOVE ZUT0000000A TO ZUT00000026(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000034
               MOVE LENGTH OF ZUT00000034 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000026(1)
               MOVE 254 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000026(2)
               MOVE 254 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
      * END
           DISPLAY 'TEST_TEST2 Successful.'
           GOBACK.
       THROW-ASSERTION.
           SET ADDRESS OF AZ-COMPARE-ITEM-NAME TO
           AZ-COMPARE-ITEM-NAME-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-VALUE TO
           AZ-COMPARE-ITEM-VALUE-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-EXP-VALUE TO
           AZ-COMPARE-ITEM-EXP-VALUE-PTR.
      *    display error message and ends test
           DISPLAY '****************************************************
      -    '****************************'
           DISPLAY 'AZU2001W The test "' AZ-TEST(1:AZ-TEST-NAME-LEN) '"
      -    'failed due to an assertion.'
           DISPLAY 'AZU1101I ' MESSAGE-TXT OF AZ-ASSERT(1:MESSAGE-LEN
           OF AZ-ASSERT)
           DISPLAY ' Data item name : '
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
           DISPLAY '  Value         : '
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
           DISPLAY '  Expected value: '
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
           DISPLAY '****************************************************
      -    '****************************'
           CALL BZUASSRT USING AZ-P1 AZ-P2 AZ-P3 AZ-ASSERT
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'ITEM NAME='
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-TRACE
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'VALUE='
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-trace
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'EXPECTED VALUE='
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-TRACE
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           EXIT.
       END PROGRAM TEST_TEST2.
      *+---------------------------------------------------------------+
      *| TEST_TEST3                                                    |
      *|     This program is for Test TEST3                            |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'TEST_TEST3'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PROGRAM-NAME   PIC X(8)  VALUE 'LGICDB01'.
       01 AZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM CICS CALLBACK'.
       01  AZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  AZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  AZ-P3 PIC X(3) VALUE 'AZU'.
       01 AZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 ASSERT-ST.
         03 ASSERT-RC PIC 9(9) BINARY VALUE 4.
         03 ASSERT-TEXT PIC 9(4) BINARY VALUE 0.
       01 AZ-TEST-NAME-LEN       PIC S9(9) COMP-5 EXTERNAL.
       01 AZ-TEST-NAME           PIC X(254) EXTERNAL.
       1 AZ-TEST-EXPECTED-DATA-VALUE.
          3 ZUT00000038.
            5 PIC X(6) DISPLAY VALUE '01ICUS'.
          3 ZUT00000039.
            5 PIC X(6) DISPLAY VALUE 'Andrew'.
            5 PIC X(4) DISPLAY VALUE SPACES.
          3 ZUT0000003A.
            5 PIC X(5) DISPLAY VALUE 'Pandy'.
            5 PIC X(15) DISPLAY VALUE SPACES.
          3 ZUT0000003B.
            5 PIC X(10) DISPLAY VALUE '1950-07-11'.
          3 ZUT0000003C.
            5 PIC X(20) DISPLAY VALUE SPACES.
          3 ZUT0000003D.
            5 PIC X(2) DISPLAY VALUE '35'.
            5 PIC X(2) DISPLAY VALUE SPACES.
          3 ZUT0000003E.
            5 PIC X(7) DISPLAY VALUE 'PI101OO'.
            5 PIC X(1) DISPLAY VALUE SPACES.
          3 ZUT0000003F.
            5 PIC X(12) DISPLAY VALUE '07799 123456'.
            5 PIC X(8) DISPLAY VALUE SPACES.
          3 ZUT00000040.
            5 PIC X(12) DISPLAY VALUE '01962 811234'.
            5 PIC X(8) DISPLAY VALUE SPACES.
          3 ZUT00000041.
            5 PIC X(20) DISPLAY VALUE 'A.Pandy@beebhouse.co'.
            5 PIC X(1) DISPLAY VALUE 'm'.
            5 PIC X(79) DISPLAY VALUE SPACES.
          3 ZUT00000042.
            5 PIC X(32267) DISPLAY VALUE SPACES.
       1 AZ-COMPARE.
         3 AZ-COMPARE-ITEM-NAME-PTR  POINTER.
         3 AZ-COMPARE-ITEM-NAME-LEN  PIC S9(9) COMP-5.
         3 AZ-COMPARE-ITEM-VALUE-PTR POINTER.
         3 AZ-COMPARE-ITEM-VALUE-LEN PIC S9(9) COMP-5.
         3 AZ-COMPARE-ITEM-EXP-VALUE-PTR POINTER.
         3 AZ-COMPARE-ITEM-EXP-VALUE-LEN PIC S9(9) COMP-5.
       LOCAL-STORAGE SECTION.
       1 AZ-COMPARE-ITEM-NAMES.
         3 ZUT0000000B.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT0000000D.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT0000000F.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-NUM OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT00000011.
            5 PIC X(20) DISPLAY VALUE 'CA-FIRST-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000013.
            5 PIC X(20) DISPLAY VALUE 'CA-LAST-NAME OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT00000015.
            5 PIC X(20) DISPLAY VALUE 'CA-DOB OF CA-CUSTOME'.
            5 PIC X(20) DISPLAY VALUE 'R-REQUEST OF DFHCOMM'.
            5 PIC X(4) DISPLAY VALUE 'AREA'.
         3 ZUT00000017.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000019.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NUM OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000001B.
            5 PIC X(20) DISPLAY VALUE 'CA-POSTCODE OF CA-CU'.
            5 PIC X(20) DISPLAY VALUE 'STOMER-REQUEST OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT0000001D.
            5 PIC X(20) DISPLAY VALUE 'CA-NUM-POLICIES OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT0000001F.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-MOBILE OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000021.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-HOME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000023.
            5 PIC X(20) DISPLAY VALUE 'CA-EMAIL-ADDRESS OF '.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-REQUEST '.
            5 PIC X(14) DISPLAY VALUE 'OF DFHCOMMAREA'.
         3 ZUT00000025.
            5 PIC X(20) DISPLAY VALUE 'CA-POLICY-DATA OF CA'.
            5 PIC X(20) DISPLAY VALUE '-CUSTOMER-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT00000027.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000028.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000029.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-NUM OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000002A.
            5 PIC X(20) DISPLAY VALUE 'CA-FIRST-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT0000002B.
            5 PIC X(20) DISPLAY VALUE 'CA-LAST-NAME OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000002C.
            5 PIC X(20) DISPLAY VALUE 'CA-DOB OF CA-CUSTOME'.
            5 PIC X(20) DISPLAY VALUE 'R-REQUEST OF DFHCOMM'.
            5 PIC X(4) DISPLAY VALUE 'AREA'.
         3 ZUT0000002D.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT0000002E.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NUM OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000002F.
            5 PIC X(20) DISPLAY VALUE 'CA-POSTCODE OF CA-CU'.
            5 PIC X(20) DISPLAY VALUE 'STOMER-REQUEST OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000030.
            5 PIC X(20) DISPLAY VALUE 'CA-NUM-POLICIES OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000031.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-MOBILE OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000032.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-HOME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000033.
            5 PIC X(20) DISPLAY VALUE 'CA-EMAIL-ADDRESS OF '.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-REQUEST '.
            5 PIC X(14) DISPLAY VALUE 'OF DFHCOMMAREA'.
         3 ZUT00000034.
            5 PIC X(20) DISPLAY VALUE 'CA-POLICY-DATA OF CA'.
            5 PIC X(20) DISPLAY VALUE '-CUSTOMER-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT00000035.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000036.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000037.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-NUM OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
       1 AZ-COMPARE-WORK-ITEMS.
          3 ZUT0000000C PIC X(6) OCCURS 2.
          3 ZUT0000000E PIC 9(2) OCCURS 2.
          3 ZUT00000010 PIC 9(10) OCCURS 2.
          3 ZUT00000012 PIC X(10) OCCURS 2.
          3 ZUT00000014 PIC X(20) OCCURS 2.
          3 ZUT00000016 PIC X(10) OCCURS 2.
          3 ZUT00000018 PIC X(20) OCCURS 2.
          3 ZUT0000001A PIC X(4) OCCURS 2.
          3 ZUT0000001C PIC X(8) OCCURS 2.
          3 ZUT0000001E PIC 9(3) OCCURS 2.
          3 ZUT00000020 PIC X(20) OCCURS 2.
          3 ZUT00000022 PIC X(20) OCCURS 2.
          3 ZUT00000024 PIC X(100) OCCURS 2.
          3 ZUT00000026 PIC X(32267) OCCURS 2.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-COMPARE-ITEM-NAME      PIC X(254).
       01 AZ-COMPARE-ITEM-VALUE     PIC X(254).
       01 AZ-COMPARE-ITEM-EXP-VALUE PIC X(254).
       1 DFHEIBLK.
         2 EIBTIME PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBDATE PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRNID PICTURE X(4).
         2 EIBTASKN PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRMID PICTURE X(4).
         2 DFHEIGDI PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCPOSN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCALEN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBAID PICTURE X(1).
         2 EIBFN PICTURE X(2).
         2 EIBRCODE PICTURE X(6).
         2 EIBDS PICTURE X(8).
         2 EIBREQID PICTURE X(8).
         2 EIBRSRCE PICTURE X(8).
         2 EIBSYNC PICTURE X.
         2 EIBFREE PICTURE X.
         2 EIBRECV PICTURE X.
         2 EIBSEND PICTURE X.
         2 EIBATT PICTURE X.
         2 EIBEOC PICTURE X.
         2 EIBFMH PICTURE X.
         2 EIBCOMPL PICTURE X(1).
         2 EIBSIG PICTURE X(1).
         2 EIBCONF PICTURE X(1).
         2 EIBERR PICTURE X(1).
         2 EIBERRCD PICTURE X(4).
         2 EIBSYNRB PICTURE X.
         2 EIBNODAT PICTURE X.
         2 EIBRESP PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRESP2 PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRLDBK PICTURE X(1).
       1 DFHCOMMAREA.
         3 CA-REQUEST-ID PIC X(6).
         3 CA-RETURN-CODE PIC 9(2).
         3 CA-CUSTOMER-NUM PIC 9(10).
         3 CA-REQUEST-SPECIFIC PIC X(32482).
         3 CA-CUSTOMER-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-FIRST-NAME PIC X(10).
         5 CA-LAST-NAME PIC X(20).
         5 CA-DOB PIC X(10).
         5 CA-HOUSE-NAME PIC X(20).
         5 CA-HOUSE-NUM PIC X(4).
         5 CA-POSTCODE PIC X(8).
         5 CA-NUM-POLICIES PIC 9(3).
         5 CA-PHONE-MOBILE PIC X(20).
         5 CA-PHONE-HOME PIC X(20).
         5 CA-EMAIL-ADDRESS PIC X(100).
         5 CA-POLICY-DATA PIC X(32267).
         3 CA-CUSTSECR-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-CUSTSECR-PASS PIC X(32).
         5 CA-CUSTSECR-COUNT PIC X(4).
         5 CA-CUSTSECR-STATE PIC X.
         5 CA-CUSTSECR-DATA PIC X(32445).
         3 CA-POLICY-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-POLICY-NUM PIC 9(10).
         5 CA-POLICY-COMMON.
         7 CA-ISSUE-DATE PIC X(10).
         7 CA-EXPIRY-DATE PIC X(10).
         7 CA-LASTCHANGED PIC X(26).
         7 CA-BROKERID PIC 9(10).
         7 CA-BROKERSREF PIC X(10).
         7 CA-PAYMENT PIC 9(6).
         5 CA-POLICY-SPECIFIC PIC X(32400).
         5 CA-ENDOWMENT REDEFINES CA-POLICY-SPECIFIC.
         7 CA-E-WITH-PROFITS PIC X.
         7 CA-E-EQUITIES PIC X.
         7 CA-E-MANAGED-FUND PIC X.
         7 CA-E-FUND-NAME PIC X(10).
         7 CA-E-TERM PIC 99.
         7 CA-E-SUM-ASSURED PIC 9(6).
         7 CA-E-LIFE-ASSURED PIC X(31).
         7 CA-E-PADDING-DATA PIC X(32348).
         5 CA-HOUSE REDEFINES CA-POLICY-SPECIFIC.
         7 CA-H-PROPERTY-TYPE PIC X(15).
         7 CA-H-BEDROOMS PIC 9(3).
         7 CA-H-VALUE PIC 9(8).
         7 CA-H-HOUSE-NAME PIC X(20).
         7 CA-H-HOUSE-NUMBER PIC X(4).
         7 CA-H-POSTCODE PIC X(8).
         7 CA-H-FILLER PIC X(32342).
         5 CA-MOTOR REDEFINES CA-POLICY-SPECIFIC.
         7 CA-M-MAKE PIC X(15).
         7 CA-M-MODEL PIC X(15).
         7 CA-M-VALUE PIC 9(6).
         7 CA-M-REGNUMBER PIC X(7).
         7 CA-M-COLOUR PIC X(8).
         7 CA-M-CC PIC 9(4).
         7 CA-M-MANUFACTURED PIC X(10).
         7 CA-M-PREMIUM PIC 9(6).
         7 CA-M-ACCIDENTS PIC 9(6).
         7 CA-M-FILLER PIC X(32323).
         5 CA-COMMERCIAL REDEFINES CA-POLICY-SPECIFIC.
         7 CA-B-ADDRESS PIC X(255).
         7 CA-B-POSTCODE PIC X(8).
         7 CA-B-LATITUDE PIC X(11).
         7 CA-B-LONGITUDE PIC X(11).
         7 CA-B-CUSTOMER PIC X(255).
         7 CA-B-PROPTYPE PIC X(255).
         7 CA-B-FIREPERIL PIC 9(4).
         7 CA-B-FIREPREMIUM PIC 9(8).
         7 CA-B-CRIMEPERIL PIC 9(4).
         7 CA-B-CRIMEPREMIUM PIC 9(8).
         7 CA-B-FLOODPERIL PIC 9(4).
         7 CA-B-FLOODPREMIUM PIC 9(8).
         7 CA-B-WEATHERPERIL PIC 9(4).
         7 CA-B-WEATHERPREMIUM PIC 9(8).
         7 CA-B-STATUS PIC 9(4).
         7 CA-B-REJECTREASON PIC X(255).
         7 CA-B-FILLER PIC X(31298).
         5 CA-CLAIM REDEFINES CA-POLICY-SPECIFIC.
         7 CA-C-NUM PIC 9(10).
         7 CA-C-DATE PIC X(10).
         7 CA-C-PAID PIC 9(8).
         7 CA-C-VALUE PIC 9(8).
         7 CA-C-CAUSE PIC X(255).
         7 CA-C-OBSERVATIONS PIC X(255).
         7 CA-C-FILLER PIC X(31854).
       PROCEDURE DIVISION USING AZ-TEST
                      DFHEIBLK DFHCOMMAREA.
      * START
           DISPLAY 'TEST_TEST3 Started...'
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
           MOVE AZ-TEST TO AZ-TEST-NAME.
      * SET INPUT VALUE
      * CALL TEST PROGRAM
           DISPLAY 'CALL LGICDB01'
           CALL PROGRAM-NAME
           USING DFHEIBLK DFHCOMMAREA
           .
      * EVALUATE OUTPUT VALUE
             IF CA-REQUEST-ID OF DFHCOMMAREA = ZUT00000038 THEN
               CONTINUE
             ELSE
               MOVE CA-REQUEST-ID OF DFHCOMMAREA TO ZUT0000000C(1)
               MOVE ZUT00000038 TO ZUT0000000C(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000035
               MOVE LENGTH OF ZUT00000035 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000000C(1)
               MOVE 6 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000C(2)
               MOVE 6 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF (CA-RETURN-CODE OF DFHCOMMAREA IS NUMERIC)
                 AND (CA-RETURN-CODE OF DFHCOMMAREA = 0) THEN
               CONTINUE
             ELSE
               MOVE CA-RETURN-CODE OF DFHCOMMAREA TO ZUT0000000E(1)
               MOVE 0 TO ZUT0000000E(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000036
               MOVE LENGTH OF ZUT00000036 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000000E(1)
               MOVE 2 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000E(2)
               MOVE 2 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF (CA-CUSTOMER-NUM OF DFHCOMMAREA IS NUMERIC)
                 AND (CA-CUSTOMER-NUM OF DFHCOMMAREA = 0000000001) THEN
               CONTINUE
             ELSE
               MOVE CA-CUSTOMER-NUM OF DFHCOMMAREA TO ZUT00000010(1)
               MOVE 0000000001 TO ZUT00000010(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000037
               MOVE LENGTH OF ZUT00000037 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000010(1)
               MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000010(2)
               MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-FIRST-NAME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000039 THEN
               CONTINUE
             ELSE
               MOVE CA-FIRST-NAME OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000012(1)
               MOVE ZUT00000039 TO ZUT00000012(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002A
               MOVE LENGTH OF ZUT0000002A TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000012(1)
               MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000012(2)
               MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-LAST-NAME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT0000003A THEN
               CONTINUE
             ELSE
               MOVE CA-LAST-NAME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           TO ZUT00000014(1)
               MOVE ZUT0000003A TO ZUT00000014(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002B
               MOVE LENGTH OF ZUT0000002B TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000014(1)
               MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000014(2)
               MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-DOB OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT0000003B THEN
               CONTINUE
             ELSE
               MOVE CA-DOB OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA TO
           ZUT00000016(1)
               MOVE ZUT0000003B TO ZUT00000016(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002C
               MOVE LENGTH OF ZUT0000002C TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000016(1)
               MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000016(2)
               MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-HOUSE-NAME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT0000003C THEN
               CONTINUE
             ELSE
               MOVE CA-HOUSE-NAME OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000018(1)
               MOVE ZUT0000003C TO ZUT00000018(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002D
               MOVE LENGTH OF ZUT0000002D TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000018(1)
               MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000018(2)
               MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-HOUSE-NUM OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT0000003D THEN
               CONTINUE
             ELSE
               MOVE CA-HOUSE-NUM OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           TO ZUT0000001A(1)
               MOVE ZUT0000003D TO ZUT0000001A(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002E
               MOVE LENGTH OF ZUT0000002E TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000001A(1)
               MOVE 4 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000001A(2)
               MOVE 4 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-POSTCODE OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT0000003E THEN
               CONTINUE
             ELSE
               MOVE CA-POSTCODE OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           TO ZUT0000001C(1)
               MOVE ZUT0000003E TO ZUT0000001C(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000002F
               MOVE LENGTH OF ZUT0000002F TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000001C(1)
               MOVE 8 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000001C(2)
               MOVE 8 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF (CA-NUM-POLICIES OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           IS NUMERIC)
                 AND (CA-NUM-POLICIES OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA = 0) THEN
               CONTINUE
             ELSE
               MOVE CA-NUM-POLICIES OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT0000001E(1)
               MOVE 0 TO ZUT0000001E(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000030
               MOVE LENGTH OF ZUT00000030 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000001E(1)
               MOVE 3 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000001E(2)
               MOVE 3 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-PHONE-MOBILE OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           = ZUT0000003F THEN
               CONTINUE
             ELSE
               MOVE CA-PHONE-MOBILE OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000020(1)
               MOVE ZUT0000003F TO ZUT00000020(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000031
               MOVE LENGTH OF ZUT00000031 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000020(1)
               MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000020(2)
               MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-PHONE-HOME OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000040 THEN
               CONTINUE
             ELSE
               MOVE CA-PHONE-HOME OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000022(1)
               MOVE ZUT00000040 TO ZUT00000022(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000032
               MOVE LENGTH OF ZUT00000032 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000022(1)
               MOVE 20 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000022(2)
               MOVE 20 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-EMAIL-ADDRESS OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA
           = ZUT00000041 THEN
               CONTINUE
             ELSE
               MOVE CA-EMAIL-ADDRESS OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000024(1)
               MOVE ZUT00000041 TO ZUT00000024(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000033
               MOVE LENGTH OF ZUT00000033 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000024(1)
               MOVE 100 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000024(2)
               MOVE 100 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF CA-POLICY-DATA OF CA-CUSTOMER-REQUEST OF DFHCOMMAREA =
           ZUT00000042 THEN
               CONTINUE
             ELSE
               MOVE CA-POLICY-DATA OF CA-CUSTOMER-REQUEST OF
           DFHCOMMAREA TO ZUT00000026(1)
               MOVE ZUT00000042 TO ZUT00000026(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000034
               MOVE LENGTH OF ZUT00000034 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000026(1)
               MOVE 254 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000026(2)
               MOVE 254 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
      * END
           DISPLAY 'TEST_TEST3 Successful.'
           GOBACK.
       THROW-ASSERTION.
           SET ADDRESS OF AZ-COMPARE-ITEM-NAME TO
           AZ-COMPARE-ITEM-NAME-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-VALUE TO
           AZ-COMPARE-ITEM-VALUE-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-EXP-VALUE TO
           AZ-COMPARE-ITEM-EXP-VALUE-PTR.
      *    display error message and ends test
           DISPLAY '****************************************************
      -    '****************************'
           DISPLAY 'AZU2001W The test "' AZ-TEST(1:AZ-TEST-NAME-LEN) '"
      -    'failed due to an assertion.'
           DISPLAY 'AZU1101I ' MESSAGE-TXT OF AZ-ASSERT(1:MESSAGE-LEN
           OF AZ-ASSERT)
           DISPLAY ' Data item name : '
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
           DISPLAY '  Value         : '
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
           DISPLAY '  Expected value: '
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
           DISPLAY '****************************************************
      -    '****************************'
           CALL BZUASSRT USING AZ-P1 AZ-P2 AZ-P3 AZ-ASSERT
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'ITEM NAME='
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-TRACE
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'VALUE='
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-trace
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'EXPECTED VALUE='
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-TRACE
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           EXIT.
       END PROGRAM TEST_TEST3.
      *+---------------------------------------------------------------+
      *| TEST_TEST4                                                    |
      *|     This program is for Test TEST4                            |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'TEST_TEST4'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PROGRAM-NAME   PIC X(8)  VALUE 'LGICDB01'.
       01 AZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM CICS CALLBACK'.
       01  AZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  AZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  AZ-P3 PIC X(3) VALUE 'AZU'.
       01 AZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 ASSERT-ST.
         03 ASSERT-RC PIC 9(9) BINARY VALUE 4.
         03 ASSERT-TEXT PIC 9(4) BINARY VALUE 0.
       01 AZ-TEST-NAME-LEN       PIC S9(9) COMP-5 EXTERNAL.
       01 AZ-TEST-NAME           PIC X(254) EXTERNAL.
       1 AZ-TEST-EXPECTED-DATA-VALUE.
          3 ZUT00000043.
            5 PIC X(6) DISPLAY VALUE '01ICUS'.
       1 AZ-COMPARE.
         3 AZ-COMPARE-ITEM-NAME-PTR  POINTER.
         3 AZ-COMPARE-ITEM-NAME-LEN  PIC S9(9) COMP-5.
         3 AZ-COMPARE-ITEM-VALUE-PTR POINTER.
         3 AZ-COMPARE-ITEM-VALUE-LEN PIC S9(9) COMP-5.
         3 AZ-COMPARE-ITEM-EXP-VALUE-PTR POINTER.
         3 AZ-COMPARE-ITEM-EXP-VALUE-LEN PIC S9(9) COMP-5.
       LOCAL-STORAGE SECTION.
       1 AZ-COMPARE-ITEM-NAMES.
         3 ZUT0000000B.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT0000000D.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT0000000F.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-NUM OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT00000011.
            5 PIC X(20) DISPLAY VALUE 'CA-FIRST-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000013.
            5 PIC X(20) DISPLAY VALUE 'CA-LAST-NAME OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT00000015.
            5 PIC X(20) DISPLAY VALUE 'CA-DOB OF CA-CUSTOME'.
            5 PIC X(20) DISPLAY VALUE 'R-REQUEST OF DFHCOMM'.
            5 PIC X(4) DISPLAY VALUE 'AREA'.
         3 ZUT00000017.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000019.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NUM OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000001B.
            5 PIC X(20) DISPLAY VALUE 'CA-POSTCODE OF CA-CU'.
            5 PIC X(20) DISPLAY VALUE 'STOMER-REQUEST OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT0000001D.
            5 PIC X(20) DISPLAY VALUE 'CA-NUM-POLICIES OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT0000001F.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-MOBILE OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000021.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-HOME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000023.
            5 PIC X(20) DISPLAY VALUE 'CA-EMAIL-ADDRESS OF '.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-REQUEST '.
            5 PIC X(14) DISPLAY VALUE 'OF DFHCOMMAREA'.
         3 ZUT00000025.
            5 PIC X(20) DISPLAY VALUE 'CA-POLICY-DATA OF CA'.
            5 PIC X(20) DISPLAY VALUE '-CUSTOMER-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT00000027.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000028.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000029.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-NUM OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000002A.
            5 PIC X(20) DISPLAY VALUE 'CA-FIRST-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT0000002B.
            5 PIC X(20) DISPLAY VALUE 'CA-LAST-NAME OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000002C.
            5 PIC X(20) DISPLAY VALUE 'CA-DOB OF CA-CUSTOME'.
            5 PIC X(20) DISPLAY VALUE 'R-REQUEST OF DFHCOMM'.
            5 PIC X(4) DISPLAY VALUE 'AREA'.
         3 ZUT0000002D.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NAME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT0000002E.
            5 PIC X(20) DISPLAY VALUE 'CA-HOUSE-NUM OF CA-C'.
            5 PIC X(20) DISPLAY VALUE 'USTOMER-REQUEST OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
         3 ZUT0000002F.
            5 PIC X(20) DISPLAY VALUE 'CA-POSTCODE OF CA-CU'.
            5 PIC X(20) DISPLAY VALUE 'STOMER-REQUEST OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000030.
            5 PIC X(20) DISPLAY VALUE 'CA-NUM-POLICIES OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000031.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-MOBILE OF C'.
            5 PIC X(20) DISPLAY VALUE 'A-CUSTOMER-REQUEST O'.
            5 PIC X(13) DISPLAY VALUE 'F DFHCOMMAREA'.
         3 ZUT00000032.
            5 PIC X(20) DISPLAY VALUE 'CA-PHONE-HOME OF CA-'.
            5 PIC X(20) DISPLAY VALUE 'CUSTOMER-REQUEST OF '.
            5 PIC X(11) DISPLAY VALUE 'DFHCOMMAREA'.
         3 ZUT00000033.
            5 PIC X(20) DISPLAY VALUE 'CA-EMAIL-ADDRESS OF '.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-REQUEST '.
            5 PIC X(14) DISPLAY VALUE 'OF DFHCOMMAREA'.
         3 ZUT00000034.
            5 PIC X(20) DISPLAY VALUE 'CA-POLICY-DATA OF CA'.
            5 PIC X(20) DISPLAY VALUE '-CUSTOMER-REQUEST OF'.
            5 PIC X(12) DISPLAY VALUE ' DFHCOMMAREA'.
         3 ZUT00000035.
            5 PIC X(20) DISPLAY VALUE 'CA-REQUEST-ID OF DFH'.
            5 PIC X(8) DISPLAY VALUE 'COMMAREA'.
         3 ZUT00000036.
            5 PIC X(20) DISPLAY VALUE 'CA-RETURN-CODE OF DF'.
            5 PIC X(9) DISPLAY VALUE 'HCOMMAREA'.
         3 ZUT00000037.
            5 PIC X(20) DISPLAY VALUE 'CA-CUSTOMER-NUM OF D'.
            5 PIC X(10) DISPLAY VALUE 'FHCOMMAREA'.
       1 AZ-COMPARE-WORK-ITEMS.
          3 ZUT0000000C PIC X(6) OCCURS 2.
          3 ZUT0000000E PIC 9(2) OCCURS 2.
          3 ZUT00000010 PIC 9(10) OCCURS 2.
          3 ZUT00000012 PIC X(10) OCCURS 2.
          3 ZUT00000014 PIC X(20) OCCURS 2.
          3 ZUT00000016 PIC X(10) OCCURS 2.
          3 ZUT00000018 PIC X(20) OCCURS 2.
          3 ZUT0000001A PIC X(4) OCCURS 2.
          3 ZUT0000001C PIC X(8) OCCURS 2.
          3 ZUT0000001E PIC 9(3) OCCURS 2.
          3 ZUT00000020 PIC X(20) OCCURS 2.
          3 ZUT00000022 PIC X(20) OCCURS 2.
          3 ZUT00000024 PIC X(100) OCCURS 2.
          3 ZUT00000026 PIC X(32267) OCCURS 2.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-COMPARE-ITEM-NAME      PIC X(254).
       01 AZ-COMPARE-ITEM-VALUE     PIC X(254).
       01 AZ-COMPARE-ITEM-EXP-VALUE PIC X(254).
       1 DFHEIBLK.
         2 EIBTIME PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBDATE PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRNID PICTURE X(4).
         2 EIBTASKN PICTURE S9(7) USAGE COMPUTATIONAL-3.
         2 EIBTRMID PICTURE X(4).
         2 DFHEIGDI PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCPOSN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBCALEN PICTURE S9(4) USAGE COMPUTATIONAL-5.
         2 EIBAID PICTURE X(1).
         2 EIBFN PICTURE X(2).
         2 EIBRCODE PICTURE X(6).
         2 EIBDS PICTURE X(8).
         2 EIBREQID PICTURE X(8).
         2 EIBRSRCE PICTURE X(8).
         2 EIBSYNC PICTURE X.
         2 EIBFREE PICTURE X.
         2 EIBRECV PICTURE X.
         2 EIBSEND PICTURE X.
         2 EIBATT PICTURE X.
         2 EIBEOC PICTURE X.
         2 EIBFMH PICTURE X.
         2 EIBCOMPL PICTURE X(1).
         2 EIBSIG PICTURE X(1).
         2 EIBCONF PICTURE X(1).
         2 EIBERR PICTURE X(1).
         2 EIBERRCD PICTURE X(4).
         2 EIBSYNRB PICTURE X.
         2 EIBNODAT PICTURE X.
         2 EIBRESP PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRESP2 PICTURE S9(8) USAGE COMPUTATIONAL.
         2 EIBRLDBK PICTURE X(1).
       1 DFHCOMMAREA.
         3 CA-REQUEST-ID PIC X(6).
         3 CA-RETURN-CODE PIC 9(2).
         3 CA-CUSTOMER-NUM PIC 9(10).
         3 CA-REQUEST-SPECIFIC PIC X(32482).
         3 CA-CUSTOMER-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-FIRST-NAME PIC X(10).
         5 CA-LAST-NAME PIC X(20).
         5 CA-DOB PIC X(10).
         5 CA-HOUSE-NAME PIC X(20).
         5 CA-HOUSE-NUM PIC X(4).
         5 CA-POSTCODE PIC X(8).
         5 CA-NUM-POLICIES PIC 9(3).
         5 CA-PHONE-MOBILE PIC X(20).
         5 CA-PHONE-HOME PIC X(20).
         5 CA-EMAIL-ADDRESS PIC X(100).
         5 CA-POLICY-DATA PIC X(32267).
         3 CA-CUSTSECR-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-CUSTSECR-PASS PIC X(32).
         5 CA-CUSTSECR-COUNT PIC X(4).
         5 CA-CUSTSECR-STATE PIC X.
         5 CA-CUSTSECR-DATA PIC X(32445).
         3 CA-POLICY-REQUEST REDEFINES CA-REQUEST-SPECIFIC.
         5 CA-POLICY-NUM PIC 9(10).
         5 CA-POLICY-COMMON.
         7 CA-ISSUE-DATE PIC X(10).
         7 CA-EXPIRY-DATE PIC X(10).
         7 CA-LASTCHANGED PIC X(26).
         7 CA-BROKERID PIC 9(10).
         7 CA-BROKERSREF PIC X(10).
         7 CA-PAYMENT PIC 9(6).
         5 CA-POLICY-SPECIFIC PIC X(32400).
         5 CA-ENDOWMENT REDEFINES CA-POLICY-SPECIFIC.
         7 CA-E-WITH-PROFITS PIC X.
         7 CA-E-EQUITIES PIC X.
         7 CA-E-MANAGED-FUND PIC X.
         7 CA-E-FUND-NAME PIC X(10).
         7 CA-E-TERM PIC 99.
         7 CA-E-SUM-ASSURED PIC 9(6).
         7 CA-E-LIFE-ASSURED PIC X(31).
         7 CA-E-PADDING-DATA PIC X(32348).
         5 CA-HOUSE REDEFINES CA-POLICY-SPECIFIC.
         7 CA-H-PROPERTY-TYPE PIC X(15).
         7 CA-H-BEDROOMS PIC 9(3).
         7 CA-H-VALUE PIC 9(8).
         7 CA-H-HOUSE-NAME PIC X(20).
         7 CA-H-HOUSE-NUMBER PIC X(4).
         7 CA-H-POSTCODE PIC X(8).
         7 CA-H-FILLER PIC X(32342).
         5 CA-MOTOR REDEFINES CA-POLICY-SPECIFIC.
         7 CA-M-MAKE PIC X(15).
         7 CA-M-MODEL PIC X(15).
         7 CA-M-VALUE PIC 9(6).
         7 CA-M-REGNUMBER PIC X(7).
         7 CA-M-COLOUR PIC X(8).
         7 CA-M-CC PIC 9(4).
         7 CA-M-MANUFACTURED PIC X(10).
         7 CA-M-PREMIUM PIC 9(6).
         7 CA-M-ACCIDENTS PIC 9(6).
         7 CA-M-FILLER PIC X(32323).
         5 CA-COMMERCIAL REDEFINES CA-POLICY-SPECIFIC.
         7 CA-B-ADDRESS PIC X(255).
         7 CA-B-POSTCODE PIC X(8).
         7 CA-B-LATITUDE PIC X(11).
         7 CA-B-LONGITUDE PIC X(11).
         7 CA-B-CUSTOMER PIC X(255).
         7 CA-B-PROPTYPE PIC X(255).
         7 CA-B-FIREPERIL PIC 9(4).
         7 CA-B-FIREPREMIUM PIC 9(8).
         7 CA-B-CRIMEPERIL PIC 9(4).
         7 CA-B-CRIMEPREMIUM PIC 9(8).
         7 CA-B-FLOODPERIL PIC 9(4).
         7 CA-B-FLOODPREMIUM PIC 9(8).
         7 CA-B-WEATHERPERIL PIC 9(4).
         7 CA-B-WEATHERPREMIUM PIC 9(8).
         7 CA-B-STATUS PIC 9(4).
         7 CA-B-REJECTREASON PIC X(255).
         7 CA-B-FILLER PIC X(31298).
         5 CA-CLAIM REDEFINES CA-POLICY-SPECIFIC.
         7 CA-C-NUM PIC 9(10).
         7 CA-C-DATE PIC X(10).
         7 CA-C-PAID PIC 9(8).
         7 CA-C-VALUE PIC 9(8).
         7 CA-C-CAUSE PIC X(255).
         7 CA-C-OBSERVATIONS PIC X(255).
         7 CA-C-FILLER PIC X(31854).
       PROCEDURE DIVISION USING AZ-TEST
                      DFHEIBLK DFHCOMMAREA.
      * START
           DISPLAY 'TEST_TEST4 Started...'
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
           MOVE AZ-TEST TO AZ-TEST-NAME.
      * SET INPUT VALUE
           MOVE 0000000099 TO CA-CUSTOMER-NUM OF DFHCOMMAREA
      * CALL TEST PROGRAM
           DISPLAY 'CALL LGICDB01'
           CALL PROGRAM-NAME
           USING DFHEIBLK DFHCOMMAREA
           .
      * EVALUATE OUTPUT VALUE
             IF CA-REQUEST-ID OF DFHCOMMAREA = ZUT00000043 THEN
               CONTINUE
             ELSE
               MOVE CA-REQUEST-ID OF DFHCOMMAREA TO ZUT0000000C(1)
               MOVE ZUT00000043 TO ZUT0000000C(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000035
               MOVE LENGTH OF ZUT00000035 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000000C(1)
               MOVE 6 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000C(2)
               MOVE 6 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF (CA-RETURN-CODE OF DFHCOMMAREA IS NUMERIC)
                 AND (CA-RETURN-CODE OF DFHCOMMAREA = 01) THEN
               CONTINUE
             ELSE
               MOVE CA-RETURN-CODE OF DFHCOMMAREA TO ZUT0000000E(1)
               MOVE 01 TO ZUT0000000E(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000036
               MOVE LENGTH OF ZUT00000036 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000000E(1)
               MOVE 2 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000E(2)
               MOVE 2 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
             IF (CA-CUSTOMER-NUM OF DFHCOMMAREA IS NUMERIC)
                 AND (CA-CUSTOMER-NUM OF DFHCOMMAREA = 0000000099) THEN
               CONTINUE
             ELSE
               MOVE CA-CUSTOMER-NUM OF DFHCOMMAREA TO ZUT00000010(1)
               MOVE 0000000099 TO ZUT00000010(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT00000037
               MOVE LENGTH OF ZUT00000037 TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT00000010(1)
               MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT00000010(2)
               MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed in PROCEDURE DIVISION.'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
      * END
           DISPLAY 'TEST_TEST4 Successful.'
           GOBACK.
       THROW-ASSERTION.
           SET ADDRESS OF AZ-COMPARE-ITEM-NAME TO
           AZ-COMPARE-ITEM-NAME-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-VALUE TO
           AZ-COMPARE-ITEM-VALUE-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-EXP-VALUE TO
           AZ-COMPARE-ITEM-EXP-VALUE-PTR.
      *    display error message and ends test
           DISPLAY '****************************************************
      -    '****************************'
           DISPLAY 'AZU2001W The test "' AZ-TEST(1:AZ-TEST-NAME-LEN) '"
      -    'failed due to an assertion.'
           DISPLAY 'AZU1101I ' MESSAGE-TXT OF AZ-ASSERT(1:MESSAGE-LEN
           OF AZ-ASSERT)
           DISPLAY ' Data item name : '
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
           DISPLAY '  Value         : '
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
           DISPLAY '  Expected value: '
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
           DISPLAY '****************************************************
      -    '****************************'
           CALL BZUASSRT USING AZ-P1 AZ-P2 AZ-P3 AZ-ASSERT
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'ITEM NAME='
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-TRACE
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'VALUE='
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-trace
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'EXPECTED VALUE='
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-TRACE
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           EXIT.
       END PROGRAM TEST_TEST4.
      *+---------------------------------------------------------------+
      *| BZU_INIT                                                     |
      *|     Initial Procedure                                         |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'BZU_INIT'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AZ-TEST-NAME-LEN      PIC S9(9) COMP-5.
       01 AZ-TESTCASE-ID        PIC X(36)
           VALUE '6ea0b529-590e-4ba6-8ee3-50ddefa2a081'.
       LINKAGE SECTION.
       01 AZ-TEST               PIC X(80).
       01 AZ-TEST-ID            PIC X(80).
       PROCEDURE DIVISION USING AZ-TEST AZ-TEST-ID.
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
           DISPLAY 'BZU_INIT : ' AZ-TEST(1:AZ-TEST-NAME-LEN)
           MOVE AZ-TESTCASE-ID TO AZ-TEST-ID
           GOBACK.
       END PROGRAM BZU_INIT.
      *+---------------------------------------------------------------+
      *| BZU_TERM                                                      |
      *|     Termination Procedure                                     |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'BZU_TERM'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AZ-TEST-NAME-LEN      PIC S9(9) COMP-5.
       LINKAGE SECTION.
       01 AZ-TEST               PIC X(80).
       PROCEDURE DIVISION USING AZ-TEST.
           MOVE 0 TO AZ-TEST-NAME-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-NAME-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
           DISPLAY 'BZU_TERM : ' AZ-TEST(1:AZ-TEST-NAME-LEN)
           GOBACK.
       END PROGRAM BZU_TERM.
      *+---------------------------------------------------------------+
      *| EVALOPT                                                       |
      *|   Function to evaluate that the bit of option data            |
      *|   (1) Take AND of group common mask and option in Arg0        |
      *|   (2) Check if the group mask is equal to (1)                 |
      *|       If equal,    RTN01 is 0                                 |
      *|       If no equal, RTN01 is 1                                 |
      *+---------------------------------------------------------------+
       ID DIVISION.
       PROGRAM-ID. EVALOPT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  OUT1-REC.
         05 OUT1-DATA                PIC X(1) OCCURS 8.
       01 OUT1-DATA-R REDEFINES OUT1-REC.
         05 OUT1-DATA-UP             PIC X(4).
         05 OUT1-DATA-DOWN           PIC X(4).
       01  OUT2-REC.
         05  OUT2-DATA               PIC X(1) OCCURS 8.
       01  OUT2-DATA-R REDEFINES OUT2-REC.
         05 OUT2-DATA-UP             PIC X(4).
         05 OUT2-DATA-DOWN           PIC X(4).
       01  WORK1-REC.
         05  WORK1-DATA              PIC X(1) OCCURS 8.
       01  WORK1-DATA-R REDEFINES WORK1-REC.
         05 WORK1-DATA-UP            PIC X(4).
         05 WORK1-DATA-DOWN          PIC X(4).
       01  WORK-AREA.
         05  WORK-HEX-UP             PIC 9(4)  COMP.
         05  WORK-HEX-DOWN           PIC 9(4)  COMP.
       01  HEX-CHG-BEF.
         05  HEX-CHANGE-LV           PIC X(1) VALUE LOW-VALUE.
         05  HEX-CHANGE-BEFORE       PIC X(1).
       01  HEX-CHG-AFT      REDEFINES  HEX-CHG-BEF.
         05  HEX-CHANGE-AFTER        PIC 9(4)  COMP.
       01  TBL-CHANGE-DATA.
          05  FILLER                 PIC  X(004) VALUE '0000'.
          05  FILLER                 PIC  X(001) VALUE '0'.
          05  FILLER                 PIC  X(004) VALUE '0001'.
          05  FILLER                 PIC  X(001) VALUE '1'.
          05  FILLER                 PIC  X(004) VALUE '0010'.
          05  FILLER                 PIC  X(001) VALUE '2'.
          05  FILLER                 PIC  X(004) VALUE '0011'.
          05  FILLER                 PIC  X(001) VALUE '3'.
          05  FILLER                 PIC  X(004) VALUE '0100'.
          05  FILLER                 PIC  X(001) VALUE '4'.
          05  FILLER                 PIC  X(004) VALUE '0101'.
          05  FILLER                 PIC  X(001) VALUE '5'.
          05  FILLER                 PIC  X(004) VALUE '0110'.
          05  FILLER                 PIC  X(001) VALUE '6'.
          05  FILLER                 PIC  X(004) VALUE '0111'.
          05  FILLER                 PIC  X(001) VALUE '7'.
          05  FILLER                 PIC  X(004) VALUE '1000'.
          05  FILLER                 PIC  X(001) VALUE '8'.
          05  FILLER                 PIC  X(004) VALUE '1001'.
          05  FILLER                 PIC  X(001) VALUE '9'.
          05  FILLER                 PIC  X(004) VALUE '1010'.
          05  FILLER                 PIC  X(001) VALUE 'A'.
          05  FILLER                 PIC  X(004) VALUE '1011'.
          05  FILLER                 PIC  X(001) VALUE 'B'.
          05  FILLER                 PIC  X(004) VALUE '1100'.
          05  FILLER                 PIC  X(001) VALUE 'C'.
          05  FILLER                 PIC  X(004) VALUE '1101'.
          05  FILLER                 PIC  X(001) VALUE 'D'.
          05  FILLER                 PIC  X(004) VALUE '1110'.
          05  FILLER                 PIC  X(001) VALUE 'E'.
          05  FILLER                 PIC  X(004) VALUE '1111'.
          05  FILLER                 PIC  X(001) VALUE 'F'.
          01  TBL-DATA REDEFINES TBL-CHANGE-DATA.
           05  TBL-CHG  OCCURS  16 TIMES.
             10  TBL-BIT-CHAR        PIC  X(004).
             10  TBL-HEX-CHAR        PIC  X(001).
       01 BIT-COUNT                  PIC 9(1).
       01 I                          PIC S9(8) COMP.
       LINKAGE SECTION.
       01 G-MASK.
         03 D-G-MASK                 PIC X(1) OCCURS 19.
       01 COM-MASK.
         03 D-COM-MASK               PIC X(1) OCCURS 19.
       01 O-ARG0.
         03 D-O-ARG0                 PIC X(1) OCCURS 19.
       01 BYTE-COUNT                 PIC S9(8) COMP.
       01 RTN01                      PIC 9(1).
       PROCEDURE DIVISION USING G-MASK COM-MASK O-ARG0 BYTE-COUNT
            RTN01.
            MOVE 0 TO RTN01
            PERFORM VARYING I FROM 1 BY 1 UNTIL I > BYTE-COUNT
              PERFORM ANDCOMMASK
              IF RTN01 = 1 THEN
                GOBACK
              END-IF
            END-PERFORM.
            EXIT PROGRAM.
       ANDCOMMASK.
      * CONVERT GROUP COMMON MASK TO BIT
            MOVE D-COM-MASK(I) TO HEX-CHANGE-BEFORE.
            DIVIDE 16 INTO HEX-CHANGE-AFTER GIVING WORK-HEX-UP
                                         REMAINDER WORK-HEX-DOWN.
            MOVE TBL-BIT-CHAR(WORK-HEX-UP + 1)   TO OUT1-DATA-UP.
            MOVE TBL-BIT-CHAR(WORK-HEX-DOWN + 1) TO OUT1-DATA-DOWN.
      * CONVERT OPTION IN ARG0 TO BIT
            MOVE D-O-ARG0(I) TO HEX-CHANGE-BEFORE.
            DIVIDE 16 INTO HEX-CHANGE-AFTER GIVING WORK-HEX-UP
                                         REMAINDER WORK-HEX-DOWN.
            MOVE TBL-BIT-CHAR(WORK-HEX-UP + 1)   TO OUT2-DATA-UP.
            MOVE TBL-BIT-CHAR(WORK-HEX-DOWN + 1) TO OUT2-DATA-DOWN.
      * CREATE EVAL BIT FROM GROUP COMMON MASK BIT AND ARG0 BIT
            PERFORM VARYING BIT-COUNT FROM 1 BY 1 UNTIL BIT-COUNT > 8
              IF OUT1-DATA(BIT-COUNT) = '1' AND
                 OUT2-DATA(BIT-COUNT) = '1' THEN
                MOVE '1' TO WORK1-DATA(BIT-COUNT)
              ELSE
                MOVE '0' TO WORK1-DATA(BIT-COUNT)
              END-IF
            END-PERFORM.
      * CONVERT GROUP MASK TO BIT DATA
            MOVE D-G-MASK(I) TO HEX-CHANGE-BEFORE.
            DIVIDE 16 INTO HEX-CHANGE-AFTER GIVING WORK-HEX-UP
                                         REMAINDER WORK-HEX-DOWN.
            MOVE TBL-BIT-CHAR(WORK-HEX-UP + 1)   TO OUT1-DATA-UP.
            MOVE TBL-BIT-CHAR(WORK-HEX-DOWN + 1) TO OUT1-DATA-DOWN.
      * CHECK IF EQUAL BETWEEN EVAL BIT AND GROUP MASK BIT
            IF WORK1-DATA-UP = OUT1-DATA-UP AND
               WORK1-DATA-DOWN = OUT1-DATA-DOWN THEN
              CONTINUE
            ELSE
              MOVE 1 TO RTN01
            END-IF
            EXIT.
       END PROGRAM 'EVALOPT'.
      *+---------------------------------------------------------------+
      *| AZU_GENERIC_CICS_DB2                                          |
      *|   Generic callback exit point                                 |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'AZU_GENERIC_CICS_DB2'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
      * CHECK OUTPUT VALUE
      * DB2_INPT.
           ENTRY 'DB2_INPT'.
           DISPLAY 'DB2_INPT ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * DB2_OUTP.
           ENTRY 'DB2_OUTP'.
           DISPLAY 'DB2_OUTP ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * CICS_INPT.
           ENTRY 'CICS_INPT'.
           DISPLAY 'CICS_INPT ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * CICS_OUTP.
           ENTRY 'CICS_OUTP'.
           DISPLAY 'CICS_OUTP ...'
           MOVE 4 TO RETURN-CODE.
           GOBACK.
      * CICS_INPT_0E08 FOR RETURN.
           ENTRY 'CICS_INPT_0E08'.
           DISPLAY 'CICS_INPT_0E08 ...'
           MOVE 0 TO RETURN-CODE.
           GOBACK.
       END PROGRAM 'AZU_GENERIC_CICS_DB2'.
      *+---------------------------------------------------------------+
      *| Program for EXEC CICS RETURN                                  |
      *|    Function code: 0E08                                        |
      *|                                                               |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'CICS_0E08_LGICDB01'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM CICS CALLBACK'.
       01  AZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  AZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  AZ-P3 PIC X(3) VALUE 'AZU'.
       01 AZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 AZ-TEST-LEN       PIC S9(8) COMP.
       01 AZ-RECORD.
         03 AZ-RECORD-COUNT-OT OCCURS 1 PIC 9(5) COMP-5 VALUE 0.
         03 AZ-RECORD-COUNT-IN OCCURS 1 PIC 9(5) COMP-5 VALUE 0.
       01 AZ-OPT-MASK-DATA2  PIC X(2).
       01 AZ-OPT-MASK-DATA9  PIC X(9).
       01 AZ-OPT-MASK-DATA11 PIC X(11).
       01 AZ-OPT-MASK-DATA19 PIC X(19).
       01 AZ-OPT-BYTECOUNT   PIC S9(8) COMP.
       01 AZ-OPT-RC          PIC 9(1) VALUE 0.
       01 AZ-OPT-COMMASK.
         03  AZ-OPT-COMMASK-DATA2  PIC X(2) OCCURS 1.
         03  AZ-OPT-COMMASK-DATA9  PIC X(9) OCCURS 1.
         03  AZ-OPT-COMMASK-DATA11 PIC X(11) OCCURS 1.
         03  AZ-OPT-COMMASK-DATA19 PIC X(19) OCCURS 1.
       01 AZ-LINE-BYTE      PIC S9(2) COMP.
       01 AZ-LINE-NUM       PIC 9(5).
       01 AZ-LINE-NUM-R   REDEFINES AZ-LINE-NUM.
         03 AZ-LINE-NUM-RD  PIC 9(1) OCCURS 5.
       01 AZ-LINE-I         PIC S9(8) COMP.
       01 AZ-LINE-J         PIC S9(8) COMP.
       LOCAL-STORAGE SECTION.
       LINKAGE SECTION.
       01 AZ-TEST                   PIC X(80).
       01 AZ-INFO-BLOCK.
          COPY BZUITERC.
       01 AZ-MODX                   PIC X(4).
       01 AZ-DFHEIBLK.
         03 FILLER                  PIC X(85).
       01 AZ-DFHCOMMAREA.
         03 FILLER                  PIC X(1).
       01 AZ-COMPARE-ITEM-NAME      PIC X(254).
       01 AZ-COMPARE-ITEM-VALUE     PIC X(254).
       01 AZ-COMPARE-ITEM-EXP-VALUE PIC X(254).
       01 ARG0.
         03 ARG0-1        PIC X(2).
         03 ARG0-A        PIC X(28).
         03 ARG0-B REDEFINES ARG0-A.
           05 ARG0-2      PIC X(9).
           05 FILLER      PIC X(19).
         03 ARG0-C REDEFINES ARG0-A.
           05 FILLER      PIC X(6).
           05 ARG0-D.
             07 ARG0-3    PIC 9(1) OCCURS 22.
       01 ARG1            POINTER.
       01 ARG2            POINTER.
       01 ARG3            POINTER.
       01 ARG4            POINTER.
       01 ARG5            POINTER.
       01 ARG6            POINTER.
       01 ARG7            POINTER.
       01 ARG8            POINTER.
       01 ARG9            POINTER.
       01 ARG10           POINTER.
       01 AZ-CICS-TARGET-NAME-DEF4 PIC X(4).
       01 AZ-CICS-TARGET-NAME-DEF7 PIC X(7).
       01 AZ-CICS-TARGET-NAME-DEF8 PIC X(8).
       PROCEDURE DIVISION.
      * CHECK OUTPUT VALUE
      * CICS_INPT_0E08_LGICDB01.
           ENTRY 'CICS_INPT_0E08_LGICDB01' USING AZ-TEST
           AZ-INFO-BLOCK AZ-DFHEIBLK AZ-DFHCOMMAREA ARG0 ARG1 ARG2
           ARG3 ARG4 ARG5 ARG6 ARG7 ARG8 ARG9 ARG10.
           DISPLAY 'CICS_0E08_LGICDB01 CHECK VALUES...'
           MOVE 4 TO RETURN-CODE.
           MOVE 0 TO AZ-TEST-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * SET GROUP OPTION COMMON MASK IN CICS GROUP
           MOVE X'0000' TO AZ-OPT-COMMASK-DATA2(1).
      * EXEC CICS RETURN X'0000'
           IF ARG0-1 = X'0E08'
             MOVE X'0000' TO AZ-OPT-MASK-DATA2
             MOVE 2 TO AZ-OPT-BYTECOUNT
             CALL 'EVALOPT' USING AZ-OPT-MASK-DATA2
               AZ-OPT-COMMASK-DATA2(1) ARG0-2
               AZ-OPT-BYTECOUNT AZ-OPT-RC
             IF AZ-OPT-RC = 0 THEN
               MOVE 3 TO AZ-LINE-BYTE
               PERFORM GETLINENUM
               DISPLAY 'EXEC CICS RETURN X''0000'''
                ' L=' AZ-LINE-NUM
               ADD 1 TO AZ-RECORD-COUNT-OT(1)
               EVALUATE AZ-TEST(1:AZ-TEST-LEN)
                 WHEN SPACE
                   CONTINUE
                 WHEN 'TEST2'
                   PERFORM O0E080-TEST2
                   CONTINUE
                 WHEN 'TEST3'
                   PERFORM O0E080-TEST3
                   CONTINUE
                 WHEN 'TEST4'
                   PERFORM O0E080-TEST4
                   CONTINUE
                 WHEN OTHER
                   CONTINUE
                 END-EVALUATE
             END-IF
           END-IF.
           PERFORM TEARDOWN.
      * SET INPUT VALUE
      * CICS_OUTP_0E08_LGICDB01.
           ENTRY 'CICS_OUTP_0E08_LGICDB01' USING AZ-TEST
           AZ-INFO-BLOCK AZ-DFHEIBLK AZ-DFHCOMMAREA ARG0 ARG1 ARG2
           ARG3 ARG4 ARG5 ARG6 ARG7 ARG8 ARG9 ARG10.
           DISPLAY 'CICS_0E08_LGICDB01 INPUT VALUES...'
           MOVE 0 TO RETURN-CODE.
           MOVE 0 TO AZ-TEST-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * SET GROUP OPTION COMMON MASK IN CICS GROUP
           MOVE X'0000' TO AZ-OPT-COMMASK-DATA2(1).
      * EXEC CICS RETURN X'0000'
           IF ARG0-1 = X'0E08'
             MOVE X'0000' TO AZ-OPT-MASK-DATA2
             MOVE 2 TO AZ-OPT-BYTECOUNT
             CALL 'EVALOPT' USING AZ-OPT-MASK-DATA2
               AZ-OPT-COMMASK-DATA2(1) ARG0-2
               AZ-OPT-BYTECOUNT AZ-OPT-RC
             IF AZ-OPT-RC = 0 THEN
               MOVE 3 TO AZ-LINE-BYTE
               PERFORM GETLINENUM
               DISPLAY 'EXEC CICS RETURN X''0000'''
                ' L=' AZ-LINE-NUM
               ADD 1 TO AZ-RECORD-COUNT-IN(1)
               EVALUATE AZ-TEST(1:AZ-TEST-LEN)
                 WHEN SPACE
                   CONTINUE
                 WHEN 'TEST2'
                   CONTINUE
                 WHEN 'TEST3'
                   CONTINUE
                 WHEN 'TEST4'
                   CONTINUE
                 WHEN OTHER
                   CONTINUE
                 END-EVALUATE
             END-IF
           END-IF.
           PERFORM TEARDOWN.
       O0E080-TEST2.
           IF AZ-RECORD-COUNT-OT(1) = 0 THEN
             CONTINUE
           ELSE
             CONTINUE
           END-IF.
       O0E080-TEST3.
           IF AZ-RECORD-COUNT-OT(1) = 0 THEN
             CONTINUE
           ELSE
             CONTINUE
           END-IF.
       O0E080-TEST4.
           IF AZ-RECORD-COUNT-OT(1) = 0 THEN
             CONTINUE
           ELSE
             CONTINUE
           END-IF.
       GETLINENUM.
           MOVE 1 TO AZ-LINE-J
           PERFORM VARYING AZ-LINE-I FROM AZ-LINE-BYTE BY 1
             UNTIL AZ-LINE-I > AZ-LINE-BYTE + 5
             MOVE ARG0-3(AZ-LINE-I) TO AZ-LINE-NUM-RD(AZ-LINE-J)
             ADD 1 TO AZ-LINE-J
           END-PERFORM
           EXIT.
      * END
       TEARDOWN.
           DISPLAY 'CICS_0E08_LGICDB01 Successful.'
           GOBACK.
       END PROGRAM 'CICS_0E08_LGICDB01'.
      *+---------------------------------------------------------------+
      *| Program for EXEC SQL SELECT_INTO                              |
      *|    Function code: 00E7                                        |
      *|                                                               |
      *+---------------------------------------------------------------+
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'DB2_00E7_LGICDB01'.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AZ-ASSERT.
         03 MESSAGE-LEN PIC S9(4) COMP-4 VALUE 24.
         03 MESSAGE-TXT PIC X(254) VALUE 'HELLO FROM CICS CALLBACK'.
       01  AZ-P1 PIC S9(9) COMP-4 VALUE 4.
       01  AZ-P2 PIC S9(9) COMP-4 VALUE 2001.
       01  AZ-P3 PIC X(3) VALUE 'AZU'.
       01 AZ-TRACE.
         03 TRACE-LEN       PIC S9(4) COMP-4 VALUE 5.
         03 TRACE-TXT       PIC X(254) VALUE 'TRACE'.
       01 BZUASSRT          PIC X(8) VALUE 'BZUASSRT'.
       01 BZUTRACE          PIC X(8) VALUE 'BZUTRACE'.
       01 AZ-TEST-LEN        PIC S9(8) COMP.
       01 AZ-RECORD.
         03 AZ-RECORD-COUNT-OT OCCURS 1 PIC 9(5) COMP-5 VALUE 0.
         03 AZ-RECORD-COUNT-IN OCCURS 1 PIC 9(5) COMP-5 VALUE 0.
         03 AZ-OUT-PARM-NUM  PIC 9(8).
         03 AZ-IN-PARM-NUM   PIC 9(8).
         03 AZ-STMT-NUM      PIC 9(9).
       1 AZ-COMPARE EXTERNAL.
         3 AZ-COMPARE-ITEM-NAME-PTR POINTER.
         3 AZ-COMPARE-ITEM-NAME-LEN PIC S9(9) COMP-5.
         3 AZ-COMPARE-ITEM-VALUE-PTR POINTER.
         3 AZ-COMPARE-ITEM-VALUE-LEN PIC S9(9) COMP-5.
         3 AZ-COMPARE-ITEM-EXP-VALUE-PTR POINTER.
         3 AZ-COMPARE-ITEM-EXP-VALUE-LEN PIC S9(9) COMP-5.
       1 AZ-TEST-INPUT-DATA-VALUE.
          3 ZUT00000000.
            5 PIC X(6) DISPLAY VALUE 'Andrew'.
            5 PIC X(4) DISPLAY VALUE SPACES.
          3 ZUT00000001.
            5 PIC X(6) DISPLAY VALUE 'Andrew'.
            5 PIC X(4) DISPLAY VALUE SPACES.
       LOCAL-STORAGE SECTION.
       01 AZ-HOSTVAR-PTR     POINTER.
       01 AZ-HOSTVAR-PTR-ADDR
           REDEFINES AZ-HOSTVAR-PTR PIC 9(9) COMP-5.
       1 AZ-COMPARE-ITEM-NAMES.
         3 ZUT0000000C.
            5 PIC X(20) DISPLAY VALUE 'DB2-CUSTOMERNUMBER-I'.
            5 PIC X(20) DISPLAY VALUE 'NT OF DB2-IN-INTEGER'.
            5 PIC X(1) DISPLAY VALUE 'S'.
       1 AZ-COMPARE-WORK-ITEMS.
          3 ZUT0000000D PIC -9(9) OCCURS 2.
       LINKAGE SECTION.
       01 AZ-TEST            PIC X(80).
       01 AZ-INFO-BLOCK.
          COPY BZUITERC.
       01 AZ-APLIST.
          COPY BZUDB2CP.
       01 AZ-COMPARE-ITEM-NAME      PIC X(254).
       01 AZ-COMPARE-ITEM-VALUE     PIC X(254).
       01 AZ-COMPARE-ITEM-EXP-VALUE PIC X(254).
       01 ARGO1.
          COPY BZUDB2CV.
       01 ARGI1          .
          COPY BZUDB2CV.
       01 ARGI2          .
          COPY BZUDB2CV.
       01 ARGI3          .
          COPY BZUDB2CV.
       01 ARGI4          .
          COPY BZUDB2CV.
       01 ARGI5          .
          COPY BZUDB2CV.
       01 ARGI6          .
          COPY BZUDB2CV.
       01 ARGI7          .
          COPY BZUDB2CV.
       01 ARGI8          .
          COPY BZUDB2CV.
       01 ARGI9          .
          COPY BZUDB2CV.
       1 ZUT00000002.
         3 DB2-CUSTOMERNUMBER-INT PIC S9(9) COMP.
       1 ZUT00000003.
         5 CA-FIRST-NAME PIC X(10).
       1 ZUT00000004.
         5 CA-LAST-NAME PIC X(20).
       1 ZUT00000005.
         5 CA-DOB PIC X(10).
       1 ZUT00000006.
         5 CA-HOUSE-NAME PIC X(20).
       1 ZUT00000007.
         5 CA-HOUSE-NUM PIC X(4).
       1 ZUT00000008.
         5 CA-POSTCODE PIC X(8).
       1 ZUT00000009.
         5 CA-PHONE-MOBILE PIC X(20).
       1 ZUT0000000A.
         5 CA-PHONE-HOME PIC X(20).
       1 ZUT0000000B.
         5 CA-EMAIL-ADDRESS PIC X(100).
       1 SQLCA.
         5 SQLCAID PIC X(8).
         5 SQLCABC PIC S9(9) BINARY.
         5 SQLCODE PIC S9(9) BINARY.
         5 SQLERRM.
         49 SQLERRML PIC S9(4) BINARY.
         49 SQLERRMC PIC X(70).
         5 SQLERRP PIC X(8).
         5 SQLERRD OCCURS 6 TIMES PIC S9(9) BINARY.
         5 SQLWARN.
         10 SQLWARN0 PIC X.
         10 SQLWARN1 PIC X.
         10 SQLWARN2 PIC X.
         10 SQLWARN3 PIC X.
         10 SQLWARN4 PIC X.
         10 SQLWARN5 PIC X.
         10 SQLWARN6 PIC X.
         10 SQLWARN7 PIC X.
         10 SQLWARN8 PIC X.
         10 SQLWARN9 PIC X.
         10 SQLWARNA PIC X.
         5 SQLSTATE PIC X(5).
       01 AZ-SQLDA.
          COPY BZUDB2CA.
       PROCEDURE DIVISION.
      * CHECK OUTPUT VALUE
      * DB2_INPT_00E7_LGICDB01.
           ENTRY 'DB2_INPT_00E7_LGICDB01' USING AZ-TEST
           AZ-INFO-BLOCK AZ-APLIST ARGO1.
           DISPLAY 'DB2_00E7_LGICDB01 CHECK VALUES...'
           MOVE 4 TO RETURN-CODE.
           MOVE SQL-STMT-NUM OF AZ-APLIST TO AZ-STMT-NUM
           SET ADDRESS of AZ-SQLDA TO SQL-VPARMPTR
           MOVE SQLDA-NUM OF AZ-SQLDA TO AZ-OUT-PARM-NUM
           SET ADDRESS of AZ-SQLDA TO SQL-APARMPTR
           MOVE SQLDA-NUM OF AZ-SQLDA TO AZ-IN-PARM-NUM
           SET ADDRESS OF SQLCA TO SQL-CODEPTR OF AZ-APLIST
           MOVE 0 TO AZ-TEST-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * EXEC SQL SELECT_INTO : OUT=1 IN=9
           IF AZ-OUT-PARM-NUM = 1 AND
              AZ-IN-PARM-NUM = 9 THEN
             DISPLAY 'EXEC SQL SELECT_INTO'
              ' : OUT=' 1 ' IN=' 9
              ' L=' AZ-STMT-NUM
             MOVE SQL-AVAR-ADDR OF ARGO1 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT00000002
             TO AZ-HOSTVAR-PTR
             ADD 1 TO AZ-RECORD-COUNT-OT(1)
             EVALUATE AZ-TEST(1:AZ-TEST-LEN)
               WHEN SPACE
                 CONTINUE
               WHEN 'TEST3'
                 CONTINUE
               WHEN 'TEST4'
                 PERFORM O00E70-TEST4
                 CONTINUE
               WHEN OTHER
                 CONTINUE
             END-EVALUATE
           END-IF.
           PERFORM TEARDOWN.
      * SET INPUT VALUE
      * DB2_OUTP_00E7_LGICDB01.
           ENTRY 'DB2_OUTP_00E7_LGICDB01' USING AZ-TEST
           AZ-INFO-BLOCK AZ-APLIST ARGI1 ARGI2 ARGI3 ARGI4 ARGI5 ARGI6
           ARGI7 ARGI8 ARGI9.
           DISPLAY 'DB2_00E7_LGICDB01 INPUT VALUES...'
           MOVE 0 TO RETURN-CODE.
           MOVE SQL-STMT-NUM OF AZ-APLIST TO AZ-STMT-NUM
           SET ADDRESS of AZ-SQLDA TO SQL-VPARMPTR
           MOVE SQLDA-NUM OF AZ-SQLDA TO AZ-OUT-PARM-NUM
           SET ADDRESS of AZ-SQLDA TO SQL-APARMPTR
           MOVE SQLDA-NUM OF AZ-SQLDA TO AZ-IN-PARM-NUM
           SET ADDRESS OF SQLCA TO SQL-CODEPTR OF AZ-APLIST
           MOVE 0 TO AZ-TEST-LEN.
           INSPECT AZ-TEST TALLYING AZ-TEST-LEN FOR
           CHARACTERS BEFORE INITIAL SPACE.
      * EXEC SQL SELECT_INTO : OUT=1 IN=9
           IF AZ-OUT-PARM-NUM = 1 AND
              AZ-IN-PARM-NUM = 9 THEN
             DISPLAY 'EXEC SQL SELECT_INTO'
              ' : OUT=' 1 ' IN=' 9
              ' L=' AZ-STMT-NUM
             MOVE SQL-AVAR-ADDR OF ARGI1 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT00000003
             TO AZ-HOSTVAR-PTR
             MOVE SQL-AVAR-ADDR OF ARGI2 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT00000004
             TO AZ-HOSTVAR-PTR
             MOVE SQL-AVAR-ADDR OF ARGI3 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT00000005
             TO AZ-HOSTVAR-PTR
             MOVE SQL-AVAR-ADDR OF ARGI4 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT00000006
             TO AZ-HOSTVAR-PTR
             MOVE SQL-AVAR-ADDR OF ARGI5 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT00000007
             TO AZ-HOSTVAR-PTR
             MOVE SQL-AVAR-ADDR OF ARGI6 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT00000008
             TO AZ-HOSTVAR-PTR
             MOVE SQL-AVAR-ADDR OF ARGI7 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT00000009
             TO AZ-HOSTVAR-PTR
             MOVE SQL-AVAR-ADDR OF ARGI8 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT0000000A
             TO AZ-HOSTVAR-PTR
             MOVE SQL-AVAR-ADDR OF ARGI9 TO AZ-HOSTVAR-PTR-ADDR
             SET ADDRESS OF ZUT0000000B
             TO AZ-HOSTVAR-PTR
             ADD 1 TO AZ-RECORD-COUNT-IN(1)
             EVALUATE AZ-TEST(1:AZ-TEST-LEN)
               WHEN SPACE
                 CONTINUE
               WHEN 'TEST3'
                 PERFORM I00E70-TEST3
                 CONTINUE
               WHEN 'TEST4'
                 PERFORM I00E70-TEST4
                 CONTINUE
               WHEN OTHER
                 CONTINUE
             END-EVALUATE
           END-IF.
           PERFORM TEARDOWN.
       O00E70-TEST4.
           INITIALIZE AZ-COMPARE-WORK-ITEMS
           IF AZ-RECORD-COUNT-OT(1) = 0 THEN
             CONTINUE
           ELSE IF AZ-RECORD-COUNT-OT(1) = 1
             MOVE 0 TO RETURN-CODE
             IF DB2-CUSTOMERNUMBER-INT OF ZUT00000002 = 99 THEN
               CONTINUE
             ELSE
                MOVE DB2-CUSTOMERNUMBER-INT OF ZUT00000002 TO
           ZUT0000000D(1)
               MOVE 99 TO ZUT0000000D(2)
               SET AZ-COMPARE-ITEM-NAME-PTR TO ADDRESS OF ZUT0000000C
               MOVE LENGTH OF ZUT0000000C TO AZ-COMPARE-ITEM-NAME-LEN
               SET AZ-COMPARE-ITEM-VALUE-PTR TO ADDRESS OF
           ZUT0000000D(1)
               MOVE 10 TO AZ-COMPARE-ITEM-VALUE-LEN
               SET AZ-COMPARE-ITEM-EXP-VALUE-PTR TO ADDRESS OF
           ZUT0000000D(2)
               MOVE 10 TO AZ-COMPARE-ITEM-EXP-VALUE-LEN
               MOVE 1 TO MESSAGE-LEN OF AZ-ASSERT
               STRING
                 'Compare failed at record 1 '
                 'in EXEC SQL SELECT_INTO '
                  ': OUT= 1 IN= 9 '
                 '(ListingLine=' AZ-STMT-NUM ').'
                 DELIMITED BY SIZE INTO MESSAGE-TXT OF AZ-ASSERT
                 WITH POINTER MESSAGE-LEN OF AZ-ASSERT
               END-STRING
               SUBTRACT 1 FROM MESSAGE-LEN OF AZ-ASSERT
               PERFORM THROW-ASSERTION
             END-IF
           ELSE
             CONTINUE
           END-IF
           END-IF.
       I00E70-TEST3.
           IF AZ-RECORD-COUNT-IN(1) = 0 THEN
             CONTINUE
           ELSE IF AZ-RECORD-COUNT-IN(1) = 1
           MOVE ZUT00000000 TO CA-FIRST-NAME OF ZUT00000003
           ELSE
             CONTINUE
           END-IF
           END-IF.
       I00E70-TEST4.
           IF AZ-RECORD-COUNT-IN(1) = 0 THEN
             CONTINUE
           ELSE IF AZ-RECORD-COUNT-IN(1) = 1
           MOVE ZUT00000001 TO CA-FIRST-NAME OF ZUT00000003
           MOVE 100 TO SQLCODE OF SQLCA
           ELSE
             CONTINUE
           END-IF
           END-IF.
       THROW-ASSERTION.
           SET ADDRESS OF AZ-COMPARE-ITEM-NAME TO
           AZ-COMPARE-ITEM-NAME-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-VALUE TO
           AZ-COMPARE-ITEM-VALUE-PTR.
           SET ADDRESS OF AZ-COMPARE-ITEM-EXP-VALUE TO
           AZ-COMPARE-ITEM-EXP-VALUE-PTR.
      *    display error message and ends test
           DISPLAY '****************************************************
      -    '****************************'
           DISPLAY 'AZU2001W The test "' AZ-TEST(1:AZ-TEST-LEN) '" faile
      -    'd due to an assertion.'
           DISPLAY 'AZU1101I ' MESSAGE-TXT OF AZ-ASSERT(1:MESSAGE-LEN
           OF AZ-ASSERT)
           DISPLAY ' Data item name : '
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
           DISPLAY '  Value         : '
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
           DISPLAY '  Expected value: '
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
           DISPLAY '****************************************************
      -    '****************************'
           CALL BZUASSRT USING AZ-P1 AZ-P2 AZ-P3 AZ-ASSERT
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'ITEM NAME='
           AZ-COMPARE-ITEM-NAME(1:AZ-COMPARE-ITEM-NAME-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-TRACE
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'VALUE='
           AZ-COMPARE-ITEM-VALUE(1:AZ-COMPARE-ITEM-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-trace
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           CALL BZUTRACE USING AZ-TRACE
           MOVE 1 TO TRACE-LEN OF AZ-TRACE
           STRING 'EXPECTED VALUE='
           AZ-COMPARE-ITEM-EXP-VALUE(1:AZ-COMPARE-ITEM-EXP-VALUE-LEN)
               DELIMITED BY SIZE INTO TRACE-TXT OF AZ-TRACE
               WITH POINTER TRACE-LEN OF AZ-TRACE
             END-STRING
           SUBTRACT 1 FROM TRACE-LEN OF AZ-TRACE
           CALL BZUTRACE USING AZ-TRACE
           EXIT.
           EXIT.
      * END
       TEARDOWN.
           DISPLAY 'DB2_00E7_LGICDB01 Successful.'
           GOBACK.
       END PROGRAM 'DB2_00E7_LGICDB01'.